{
  "titles": {
    "home": "home",
    "aboutme": "about me",
    "skills": "skills",
    "contacme": "contact me",
    "project": "projects",
    "techUsed": "technologies used: ",
    "appForm": "application form",
    "synlab": "synlab medica",
    "portfolio": "portfolio",
    "appAltillo": "Altillos APP",
    "personalInfo": "personal info"
  },
  "projects": {
    "appForm": {
      "first": "Landing page in which a user registered his personal information before going to the personal interview that took place in the offices.",
      "second": "This file was sent by e-mail with a unique TOKEN for security purposes. ",
      "third": "The user's name and ID number were already registered in the system, the rest of the data would be registered manually by the user.",
      "fourth": "Several internal APIs of the organization were used to obtain the lists of, for example, countries, departments, provinces and districts, which were dynamically changed depending on the previous selection.",
      "fiveth": " All this data was registered in the company's database, by means of the API post that we created."
    },
    "synlab": {
      "first": " Medical Lab is a web application that allows hospital patients to access information about their treatments, visits and prescriptions, and consists of five sections: Covid, HomeCovid, Appointment, Fast PCR and SynLab.",
      "second": "The first four sections allow patients, doctors and nurses to perform and view the results of Covid-related tests and consultations.",
      "third": "SynLab configures the four environments and controls user access to hospitals, information, analysis and manipulation of user, doctor, nurse and administrator data.",
      "fourth": "As developers, we solve problems in the web environment and improve the product according to user requests, from adding labels in the frontend to improving the security of certain functions such as captcha."
    },
    "portfolio": {
      "first": "Personal project in which I will put all the personal and academic information that involves me, as well as the projects (personal or work) in which I have developed.",
      "second": "In addition, it will serve as a letter of introduction to what I can develop so far using Vue, HTML, CSS and JavaScript/TypeScript."
    },
    "appAltillo": {
      "first": "I developed this academic project for the dissertation course at the university, including the mobile application and the documentation required to support it.",
      "second": "A mobile application was developed for SODIMAC that solved the problem of the disorderly location of products in the mezzanines.",
      "third": "The application recorded the movement of products on the shelves, including SKU, quantity and location, allowing users to find products quickly and easily.",
      "fourth": "The application allowed to register, modify and delete products, as well as to list the changes made, in order to maintain control and reduce human errors.",
      "fiveth": "It also had a QR Code reading section that could be used to display the products and their quantities in one place.",
      "sixth": "As database I used FireBase, taking advantage of the Realtime Database that they have in their services."
    }
  },
  "labels": {
    "webDev": "web developer ",
    "knowledge": "with knowledge in Vue, JS, HTML and CSS, as well as other languages such as TypeScript and Java.",
    "consider": "I consider myself a person with a high priority for responsibility and commitment to work, in addition to having skills to develop under pressure.",
    "name": "name",
    "age": "age",
    "years": "years old",
    "year": "years",
    "email": "email",
    "address": "address",
    "skill": "skill",
    "expe": "experience",
    "language": "language",
    "spanish": "spanish / english (write)",
    "freelance": "freelance",
    "available": "available",
    "portfolio1": "Creation of a Web Page using Vue/TypeScript in which the applicants for the jobs generated by the organization register and are registered in its ERP.",
    "portfolio2": "Support and maintenance of several pages belonging to the Synlab group, where using Java/FTL/JS and Vue/TypeScript we solved bugs and made new user requirements.",
    "portfolio3": "Creation of a LandingPage where to show my personal information and other characteristics.",
    "portfolio4": "Mobile application created in Flutter/DART as part of the Thesis course of the university career."
  },
  "date": {
    "jan": "jan",
    "apr": "apr",
    "aug": "aug",
    "sep": "sep",
    "dec": "dec"
  },
  "timeline": {
    "exp": {
      "title1": "junior frontend developer",
      "title2": "programming assistant",
      "title3": "installation technician",
      "title4": "sales consultant",
      "content1": "In charge of the design and development of websites and web applications using programming languages like HTML, CSS, JavaScript, Vue, etc. I participated in several projects where support is provided.",
      "content2": "Assisted in the programming of the BMS equipment for the LAP project which is responsible for the supervision and monitoring of various systems within a building.",
      "content3": "Technician in charge of channeling, wiring, installation and monitoring of the different devices in the Fire Alarm System.",
      "content4": "Also in charge of maintenance and installation of CCTV devices.",
      "content5": "Responsible for providing the correct advice to customers in the area of lighting and electricity.",
      "content6": "Also in charge of the installation of exhibits and equipment.",
      "content7": "In addition, he saw the control and tracking of products by means of kardex"
    },
    "edu": {
      "title1": "systems engineering",
      "title2": "high school - accounting",
      "title3": "elementary",
      "content1": "Bachelor's Degree in Systems Engineering. ",
      "content2": "Completed high school with specialization courses in accounting, occupying the second place of the promotion.",
      "content3": "Completed elementary school. "
    },
    "add": {
      "content1": "Course in which I saw the basics of Vue 2 & Vue 3, using the Composition API and Option API & VueX.",
      "content2": "Course to enhance my knowledge in Excel VBA.",
      "content3": "Course that I took virtually, where I could see web programming in JAVA language, in addition to seeing Springboot and Angular.",
      "content4": "Course dedicated to know the necessary concepts about HTML, CSS & JS.",
      "content5": "Course where Microsoft Office Word, Excel and Power Point were seen up to an intermediate level.",
      "content6": "Course in which I learned a programming language for the development of mobile applications for Android and IOs."
    }
  },
  "buttons": {
    "download": "download cv",
    "expe": "experience",
    "educ": "education",
    "add": "additional",
    "info": "more info"
  }
}
